//revision krte waqt meri smjh--
// “Question यही कह रहा है कि तीन ट्रिपलेट का 
//सम जीरो के बराबर होना चाहिए । ऐसे तीनों ट्रिपलेट 
//हमें फाइंड करने हैं और ट्रिपलेट में डुप्लिकेट नहीं होने चाहिए 
//। तो इसको एप्रोच करना है तो टू पॉइंटर से करेंगे और एक 
//एलिमेंट को इटरेट करते हुए रख लेंगे । तो और एक आंसर के
//लिए एक वेक्टर बना लेंगे वेक्टर और वेक्टर नेस्टेड एरे टाइप का
// और फिर क्या करेंगे सॉर्ट कर लेंगे क्योंकि टू पॉइंटर्स मतलब टू 
//पॉइंटर जब चलेगा तो सॉर्ट पर चलेगा फिर क्या करेंगे एक लेफ्ट
// ले लेंगे एक राइट ले लेंगे और जब तक लेफ्ट जो है राइट से 
//कम है मतलब पहले फॉर लूप लगाएंगे पूरे इटरेट करेंगे और फिर 
//चेक करेंगे कि क्या जब तक डुप्लिकेट आ रहे हैं स्टार्टिंग में तो वर्ड 
//कंटिन्यू करते जाएंगे फिर क्या करेंगे ट्रिप्लेट का सम करेंगे मतलब इनिशियल 
//एलिमेंट जो करेंट वाला है वो प्लस जो हमारा दो पॉइंटर्स है यानि स्टार्ट और 
//एंड नम्स ऑफ स्टार्ट नम्स ऑफ एंड को लेके एड कर देंगे और फिर चेक कर 
//लेंगे अगर सम जीरो है तो वेक्टर में पुश कर देंगे और क्या बोलते हैं वेक्टर में पुश
// कर देंगे और वेक्टर में पुश करने के बाद फिर क्या करेंगे कि देखेंगे कि क्या लेफ्ट 
//लेस देन राइट है और और जो नम्स ऑफ लेफ्ट है वो इक्वल इक्वल है नम्स ऑफ 
//लेफ्ट फाइनेस वन तो लेफ्ट को कर देंगे प्लस प्लस और यही सेम चीज राइट के लिए 
//चेक करेंगे क्या राइट जो है वो राइट माइनस वन से बराबर है तो राइट हो कर देंगे माइनस
// माइनस और ये तो ये हो गया एक बार और लेफ्ट प्लस प्लस राइट माइनस माइनस फिर 
//देखेंगे कि क्या सम लेस दैन जीरो है अगर हाँ सम लेस दैन जीरो है तो क्या करेंगे लेफ्ट को 
//प्लस प्लस कर देंगे और नहीं तो फिर एक एल्स कंडीशन डालेंगे जहाँ पे राइट माइनस माइनस 
//कर देंगे और एंड में जो रिस्पॉन्स था नेस्टेड ऐरे वाला जहाँ पे सारे ट्रिपलेट हमने पुश कर रखे थे उसको रिटर्न कर देंगे”


class Solution {
public:
    vector<vector<int>> threeSum(vector<int>& nums) {
        vector<vector<int>>ans;
        int n=nums.size();
        sort(nums.begin(),nums.end());
        for(int i=0;i<n;i++)
        {
            if(i>0 && nums[i]==nums[i-1]) continue;
            int left=i+1;
            int right=n-1;
            while(left<right)
            {
                int sum =nums[i]+nums[right]+nums[left];
                if(sum==0)
                {
                    ans.push_back({nums[i],nums[left],nums[right]});
                        while(left<right && nums[left]==nums[left
                        +1]) {
                            left++;
                        }
                        while(left<right && nums[right]==nums[right-1])
                        {
                            right--;
                        }
                        left++;
                        right--;

                    }
                    else if(sum<0)
                    {
                        //are ye sum k wala nhi hai
                        //triplet ka sum 0 wala hai
                        left++;
                    }
                    else
                    {
                        right--;
                    }
                }
        }
        return ans;
    }
};