// मान लो हमें 3 पेयर्स बनाने हैं। यानी n बराबर 3। तो हमें 3 ओपनिंग और 3 क्लोज़िंग ब्रैकेट्स लगाने हैं। अब सही कॉम्बिनेशन जैसे बनेंगे—जैसे "((()))", "(()())", "(())()", "()(())" और "()()()"। इन सब में हर ओपनिंग का सही क्लोज़िंग है, और क्रम भी ठीक है।


class Solution {
public:
     void solve(int open,int close,int n,string s,vector<string>& ans)
     {
        //चलो एक छोटा उदाहरण लेते हैं। अगर n बराबर 2 है, तो हमें 2 पेयर चाहिए। हर पेयर में एक ओपन और एक क्लोज होगा, मतलब कुल 4 कैरेक्टर— 2 ओपन और 2 क्लोज। जब हमारी स्ट्रिंग की लंबाई 4 हो जाएगी, तब हम समझ जाते हैं कि हमने पूरे 2 पेयर लगा दिए। उदाहरण के लिए,
        if(s.length()==2*n)
        {
            ans.push_back(s);
            return;
        }

        // मान लो n बराबर 2 है। शुरुआत में हमारे पास खाली स्ट्रिंग है, ओपन और क्लोज़ दोनों 0 हैं। हम पहले एक ओपनिंग ब्रैकेट जोड़ते हैं, फिर एक और ओपनिंग (अब स्ट्रिंग “((” और ओपन 2)। अब ओपन 2 होने पर हम क्लोज़ जोड़ते हैं। एक क्लोज़ जोड़कर “(()” बनता है, फिर दूसरा क्लोज़ जोड़कर “(())” बनता है। फिर हम पिछले स्टेप्स पर लौटते हैं, दूसरे रास्ते पर जाते हैं, जैसे “()()” बनाना। इस तरह हर कदम पर हम ओपन और क्लोज़ के विकल्पों को आगे बढ़ाते हैं, जब तक सभी सही संयोजन न मिल जाएँ।
        if(open<n){
            solve(open+1,close,n,s+"(",ans);
        }

        // हाँ, देखो जब क्लोज़ की संख्या ओपन से कम होती है, तो इसका मतलब है कि अभी भी कुछ ओपन ब्रैकेट ऐसे हैं जिनका जोड़ीदार क्लोज़ नहीं लगा है। इसलिए, जब भी क्लोज़ कम हो, हम एक क्लोज़िंग ब्रैकेट जोड़ते हैं ताकि बैलेंस बना रहे। इस तरह हम सुनिश्चित करते हैं कि पैरेंथेसिस का क्रम हमेशा सही रहे।
        if(close<open)
        {
            solve(open,close+1,n,s+")",ans);
        }

     }

    vector<string> generateParenthesis(int n) {
        vector<string>ans;
        solve(0,0,n,"",ans);
        return ans;
    }
};